[net]
subdivisions=1
batch=1

height=28
width=28
channels=1

momentum=0.9
decay=0.05

max_batches=10000
time_steps=1

learning_rate=0.000000000000003

policy=constant

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=0
filters=16
size=3
stride=3
pad=1
activation=leaky

[deconvolutional]
batch_normalize=0
filters=16
size=3
stride=3
pad=1
activation=leaky

[deconvolutional]
batch_normalize=0
filters=1
size=3
stride=1
pad=1
activation=leaky

[cost]
type=sse