[net]
subdivisions=1
batch=4

height=28
width=28
channels=1

momentum=0.9
decay=0.0001

max_batches=10000
time_steps=1

learning_rate=0.0005

policy=constant

[connected]
output=512
activation=leaky

[connected]
output=2
activation=linear

[route]
layers=-2

[connected]
output=2
activation=linear

[route]
layers=-1,-3

[sampling]
beta=0.5

[connected]
output=512
activation=leaky

[connected]
output=784
activation=leaky

[cost]
type=sse